<a href="https://colab.research.google.com/github/VitikaJain25/PandasRevision/blob/master/Concat_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

----Concatenate -> When we want to join 2 or more Dataframes.-------

In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather      # First DataFrame

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather           # Second DataFrame

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [0]:
df = pd.concat([india_weather,us_weather])   #Concatenated 2 data frames --- Resulted in single Dataframe --- 
df
#----We have to pass individual Data frames as arguments -- Can can pass more then 2 arguments.

# Using the index from original dataframe.

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [0]:
#-----If we dont want to retain original index and if we wish to have continous index ---
df2 = pd.concat([india_weather,us_weather],ignore_index = True)
df2


# ------ https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html ------- to learn about other arguments for Concat function.

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

In [0]:
#--- If we want to have sepearte keys for both Dataframes --- We can also pass keys----
df3 = pd.concat([india_weather,us_weather],keys = ["India", "US"])
df3


# keys argument will not work as expected if we pass "ignore_index = True" argument as well..

             city  humidity  temperature
India 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        78           30
US    0  new york        68           21
      1   chicago        65           14
      2   orlando        75           35

In [0]:
df3.loc["India"]

# We can again retrieve back the value using key from a merged Data frame.
#loc stands for Location.

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [0]:
#If you want to append / concatenate the 2nd Dataframe as column instead of appending as rows... (Column wise and not Row wise)

temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [0]:
windspeed_df = pd.DataFrame({
    "city": ["mumbai","delhi","bangalore"],
    "windspeed": [7,12,9],
})
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         12
2  bangalore          9

In [0]:
 # We want a dataframe with column Temperature (From 1st Dataframe) and column "Windspeed" (from 2nd Dataframe)
 # Concatenating Column Wise

df4 = pd.concat([temperature_df,windspeed_df],axis = 1)   #Concatenated 2 data frames --- Resulted in single Dataframe --- 
df4    # By default axis = 0.

       city  temperature       city  windspeed
0    mumbai           32     mumbai          7
1     delhi           45      delhi         12
2  banglore           30  bangalore          9

In [7]:
#---- Again creating 2 DF with imperfect Data... @nd DF will have data for only 2 cities instead of 3. And Order of cities is different

temperature_df1 = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index = [0,1,2])
temperature_df1

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [6]:
#DF2
windspeed_df1 = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index = [1,0])
windspeed_df1

     city  windspeed
1   delhi          7
0  mumbai         12

In [8]:
df5 = pd.concat([temperature_df1,windspeed_df1],axis = 1)
df5

# This doesnot look correct... As 1st rows should display data for same city..
#Thats why we will use index.
#Try running with and without Index.

#Indexing is a way to allign rows from different DF while using concat function.

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

In [9]:
# We can join DF with a series.
temperature_df1    #Lets take a DF

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [11]:
s = pd.Series(["Humid","Dry","Rain"],name = "Event")     # In mumbai weather is Humid, In delhi its dry, and Bangalore it rains.
s  #If we have a pandas series with name "Event"   #Created Series

0    Humid
1      Dry
2     Rain
Name: Event, dtype: object

In [12]:
#If we want to append series to DF.
df6 = pd.concat([temperature_df1,s],axis=1)    #Pass your DF and series -- axis = 1 as we want to add a new column and not a row.
df6   #We added series as a new column in DF.

       city  temperature  Event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain